In [1]:
#Import Dependencies
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from password import password
from password import user

In [2]:
from sqlalchemy import create_engine
engine = create_engine(f"postgresql://{user}:{password}@localhost:5432/sql_challenge")
connection = engine.connect()

In [3]:
employees_df = pd.read_sql("select * from employees", connection)
employees_df.head()

   emp_no employee_title_id  birth_date  first_name  last_name sex   hire_date
0  473302             s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053             e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444             e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786             s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238             e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 7 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   emp_no             300024 non-null  int64
 1   employee_title_id  300024 non-null  object
 2   birth_date         300024 non-null  object
 3   first_name         300024 non-null  object
 4   last_name          300024 non-null  object
 5   sex                300024 non-null  object
 6   hire_date          300024 non-null  object
dtypes: int64(1), object(6)
memory usage: 16.0+ MB